# """
# print(5, 8, 6)
# """

# n = 5
# n = 1.89

# n = None  # пустое значение

# print(n)

# # n = 'fyfcn'
# # n1 = "fycnfcbz" 

# n = 5
# print(type(n)) # type - проверка типа данных

# n = 'fyf\'cnf'  # \ - выводит слово с ковычкой (')
# n = 'fyf"ана"cnf'


# a = 5
# b = 5.89
# c = 'hello'

# print (' - ', a, b, c)

# print (f"{a} - {b} - {c}")

# print ("{} - {} - {}".format(a, b, c))

## Ввод данных

# print('Введите первое число: ') #ввод на новой строке
# a = input()
# print(a)

# b = input('Введите второе число: ') #ввод на прежней строке

# print(a, ' + ', b, ' = ', a + b) # сложились строки а не числа

# print('Введите первое число: ') 
# a = int(input()) # из строки(по умолчанию через ввод) в исловое значение

# b = int(input('Введите второе число: ')) 
# print(a, ' + ', b, ' = ', a + b) # т.к тип данных с float изменен на int происходит арефметическая операция сложения 


## Приведение типов данных

# c = 5.89
# print(c) # тип данных float
# print(type(c))
# n = int(c) # из float в int 5.89 -> 5
# print(n)
# print(type(n))

# c = 1
# print(c) 
# print(type(c))
# n = bool(c) 
# print(n)
# print(type(n))

# v = 'fyfcnfcbz'
# v = int(v) # ошибка преобразования


## Округление чисел

# a = 5.89
# b = 6.55

# print (round(a*b, 3)) # функция round - округление: первый аргумент - число которое хотим округлять, второе колличестов символов после запятой

## Сокращенное присваивание

# i = 5
# i += 1 # i = i + 1

##

# a = 1 > 4
# print(a) # выводится лож-False









